Tekla Open API Reference for Tekla Structures 2025
GeometricPlane Properties
The GeometricPlane type exposes the following members.
Properties
Name | Description
Normal
 The normal vector of the plane.
Origin
 The origin point of the plane.
Top
See Also
Reference
GeometricPlane Class
Tekla.Structures.Geometry3d Namespace